package com.neuedu.api.object0806;

public class Test {

    /**
     * 案例1： 买火车票
     *      方式： 手机
     *             火车站窗口
     *             代售点买票
     *
     *     保证不能重票
     *
     * 分析：
     * 1） 售票系统
     *     出票
     * 2）   作为客户端：调用售票系统
     *  *      方式： 手机
     *      *             火车站窗口
     *      *             代售点买票
     *
     *
     * 案例2：生产者和消费者模式
     *  分析：
     *  1）第一种情况
     *     生产者，将汉堡仓库生成满了，进入等待状态
     *     消费者，进行消费，购买汉堡，唤醒生产者进行生成
     *
     * 2）第二中情况
     *    消费者，多了，仓库清仓了，进行等待状态
     *    生产者，进行生成汉堡，唤醒消费者购买
     *
     *
     *
     *
     *
     *
     */
}
